Tasks/ЗадачиОбщие.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Task>
		<Properties>
			<Name>ЗадачиОбщие</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Автор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>АвторИсполнения</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаВыполнения</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДолжностьИсполнителя</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>30</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Исполнение</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>200</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КартинкаЕсть</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Направление</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.НаправленияОбщихЗадач</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НуженОтчетОВыполнении</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОжидаемаяДатаВыполнения</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Отменена</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОтчетОВыполнении</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Проект</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Проекты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СвязаннаяЗадача</Name>
					<Type>
						<v8:Type>cfg:TaskRef.ЗадачиОбщие</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Сообщение</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>200</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипЗадачи</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыОбщихЗадач</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Наблюдатели</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Наблюдатель</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<AddressingAttribute>
				<Properties>
					<Name>ОбъектАдресации</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
						<v8:Type>cfg:CatalogRef.Композиции</v8:Type>
						<v8:Type>cfg:TaskRef.ПроверитьГабаритныеЧертежи</v8:Type>
						<v8:Type>cfg:TaskRef.Задачи_ПКД</v8:Type>
						<v8:Type>cfg:TaskRef.СоздатьМодельГабаритногоЧертежа</v8:Type>
						<v8:Type>cfg:CatalogRef.ИзделияЗаказчика</v8:Type>
						<v8:Type>cfg:CatalogRef.Помещения</v8:Type>
						<v8:Type>cfg:CatalogRef.ИзделияКомплект</v8:Type>
						<v8:Type>cfg:TaskRef.Задачи_РКД</v8:Type>
						<v8:Type>cfg:CatalogRef.Проекты</v8:Type>
						<v8:Type>cfg:DocumentRef.Рекламации</v8:Type>
					</Type>
				</Properties>
			</AddressingAttribute>
		</ChildObjects>
	</Task>
</MetaDataObject>

InformationRegisters/ДанныеЗадачи.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>ДанныеЗадачи</Name>
			<InformationRegisterPeriodicity>Second</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Исполнитель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Причина</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Задача</Name>
					<Type>
						<v8:Type>cfg:TaskRef.ЗадачиОбщие</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/ДанныеИзделияЗаказчика.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>ДанныеИзделияЗаказчика</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Актуальность</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>НомерПоПорядку</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Артикул</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>15</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>НаименованиеСАртикулом</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Проект</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Проекты</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПриложениеКДоговору</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПриложенияКДоговорам</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ИзделиеЗаказчика</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ИзделияЗаказчика</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/КартинкиНоменклатуры.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>КартинкиНоменклатуры</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ИмяФайла</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Картинка</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ИзделиеЭлемент</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.РекламацияПодряда</v8:Type>
						<v8:Type>cfg:CatalogRef.ИзделияЗаказчика</v8:Type>
						<v8:Type>cfg:TaskRef.ЗадачиОбщие</v8:Type>
						<v8:Type>cfg:CatalogRef.ИзделияЭлемент</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Enums/ТипыОбщихЗадач.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>ТипыОбщихЗадач</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Вопрос</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Информация</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Documents/Рекламации.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Document>
		<Properties>
			<Name>Рекламации</Name>
			<Posting>Allow</Posting>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Автор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВедущийКонструктор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комплект</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ИзделияКомплект</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Конструктор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОстановитьПроизводство</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПредыдущаяСтатдияПроизводства</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>36</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Причина</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПричиныРекламации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Проект</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Проекты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РКДВыполнено</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Document>
</MetaDataObject>

Catalogs/НаправленияОбщихЗадач.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>НаправленияОбщихЗадач</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>НеИспользовать</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Порядок</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>3</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Tasks/ЗадачиОбщие/Forms/ФормаЗадачи/Ext/Form/Module.bsl
&НаКлиенте                                                 
Перем ВидимостьКнопкиНаблюдатели, стСотрудники ,НЕЗакрывать, КартитнкаДобавлена;

Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Ключ.Пустая() Тогда 
		
		Объект.НуженОтчетОВыполнении = НЕ ЗначениеЗаполнено(Объект.ОбъектАдресации);
		
		омЗаполнениеРеквизиов.ЗаполнитьРеквизитыСтандартные(Объект);
		
		Если Параметры.Свойство("ТипЗадачи") Тогда
			Объект.ТипЗадачи = Параметры.ТипЗадачи;
		КонецЕсли;
		
		Если Параметры.Свойство("СвязаннаяЗадача") Тогда
			Объект.СвязаннаяЗадача = Параметры.СвязаннаяЗадача;
		КонецЕсли;
		
		Если Параметры.Свойство("Проект") Тогда
			Объект.Проект = Параметры.Проект;
		КонецЕсли;
		
		Если Параметры.Свойство("Исполнитель") Тогда
			Исполнитель = Параметры.Исполнитель;
			
			Если ЗначениеЗаполнено(Исполнитель) Тогда
				Элементы.ПоДолжности.ТолькоПросмотр = Истина;
			КонецЕсли;
		КонецЕсли;
		
		Если Параметры.Свойство("ОбъектАдресации") Тогда
			Объект.ОбъектАдресации = Параметры.ОбъектАдресации;
			
			Если ЗначениеЗаполнено(Объект.ОбъектАдресации) Тогда
				Элементы.ОбъектАдресации.ТолькоПросмотр = Истина;
			КонецЕсли;
			
		КонецЕсли;
		
		
		ЗаполнитьНаправления();
		
		Элементы.Переадресация1.Видимость 	= Ложь;   
		Элементы.АдресКартинки.Видимость 	= Ложь;

		
	Иначе
		
		Если ПустаяСтрока(Объект.ДолжностьИсполнителя) Тогда
			ПолучитьИсполнителя();
		ИначеЕсли ЗначениеЗаполнено(Объект.ОбъектАдресации)  Тогда
			ТекущийИсполнитель = ЗаполнитьИсполнителя(Объект.ОбъектАдресации, Объект.ДолжностьИсполнителя);	
		КонецЕсли;
		
		СписокНаблюдателей.ЗагрузитьЗначения(Объект.Наблюдатели.Выгрузить().ВыгрузитьКолонку("Наблюдатель"));
		
		ЗаполнитьПереадресацию();
		
		Если ЗначениеЗаполнено(Объект.Направление) Тогда
		
			Элементы.Направление.СписокВыбора.Добавить(Объект.Направление);	
		
		КонецЕсли;
		
		Если Объект.КартинкаЕсть Тогда
		
			АдресКартинки = ПоместитьВоВременноеХранилище(Объект.Картинка.Значение.Получить());
			
		Иначе
			
			Элементы.АдресКартинки.Видимость = Ложь;
		
		КонецЕсли;

		ОбновитьКартинки();

	КонецЕсли; 
	
	Если ЗначениеЗаполнено(Объект.ОбъектАдресации) Тогда
		ДополнительноеПоле = ПолучитьДополнительнуюИнформацию(Объект.ОбъектАдресации).ДопИнформация; 
	КонецЕсли; 
	
	Если Объект.Выполнена Тогда
		Элементы.ПоДолжности.ТолькоПросмотр 	= Истина;
		Элементы.Исполнитель.ТолькоПросмотр 	= Истина;
		Элементы.Переадресация.Видимость 		= Ложь;
		Элементы.ФормаДобавитьКартинку.Видимость= Ложь;
	КонецЕсли;

	Элементы.СвязаннаяЗадача.Видимость = ЗначениеЗаполнено(Объект.СвязаннаяЗадача);
	
	Если Объект.ОтчетОВыполнении Тогда
		
		Элементы.ТипЗадачи.Видимость 			= Ложь;
		Элементы.ГруппаНаблюдатели.Видимость 	= Ложь;
		Элементы.ГруппаПереадресация.Видимость 	= Ложь;
		Элементы.Переадресация.Видимость 		= Ложь;
		Элементы.АдресКартинки.Видимость 		= Ложь;
		Элементы.Сообщение.Видимость 			= Ложь;
		Элементы.ФормаОтменить.Видимость 		= Ложь;
		Элементы.ФормаДобавитьКартинку.Видимость= Ложь;
		Элементы.Исполнение.Видимость 			= Ложь;
		ОписаниеИсполнения 						= Объект.СвязаннаяЗадача.Исполнение;
		
	Иначе
		
		Элементы.ОписаниеИсполнения.Видимость 	= Ложь;
		Элементы.ФормаОтменить.Видимость 		= НЕ (ЗначениеЗаполнено(Объект.АвторИсполнения) ИЛИ Объект.Отменена);	
		
	КонецЕсли;
	

	
КонецПроцедуры

Процедура ЗаполнитьНаправления()

	Элементы.Направление.РежимВыбораИзСписка = Истина;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	НаправленияОбщихЗадач.Ссылка КАК Ссылка,
		|	НаправленияОбщихЗадач.Наименование КАК Наименование
		|ИЗ
		|	Справочник.НаправленияОбщихЗадач КАК НаправленияОбщихЗадач
		|ГДЕ
		|	НЕ НаправленияОбщихЗадач.НеИспользовать
		|
		|УПОРЯДОЧИТЬ ПО
		|	НаправленияОбщихЗадач.Порядок УБЫВ,
		|	Наименование";
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		Элементы.Направление.СписокВыбора.Добавить(Выборка.Ссылка, Выборка.Наименование)
	КонецЦикла;
	
КонецПроцедуры

Процедура ЗаполнитьПереадресацию()

	Переадресация.Очистить();
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ДанныеЗадачи.Период КАК Дата,
		|	ДанныеЗадачи.Исполнитель КАК Исполнитель,
		|	ДанныеЗадачи.Причина КАК Причина
		|ИЗ
		|	РегистрСведений.ДанныеЗадачи КАК ДанныеЗадачи
		|ГДЕ
		|	ДанныеЗадачи.Задача = &Задача
		|
		|УПОРЯДОЧИТЬ ПО
		|	Дата УБЫВ";
	
	Запрос.УстановитьПараметр("Задача", Объект.Ссылка);
	
	Переадресация.Загрузить(Запрос.Выполнить().Выгрузить());
	
	Элементы.Переадресация1.Видимость = Переадресация.Количество() > 1;
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ЗаполнитьИсполнителя(ОбъектАдресации, ДолжностьИсполнителя)

	Возврат омСотрудники.ПолучитьИсполнителяОбъекта(ОбъектАдресации, ДолжностьИсполнителя);	

КонецФункции // ЗаполнитьИсолнителя()

Процедура ПолучитьИсполнителя()

	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ДанныеЗадачи.Исполнитель КАК Исполнитель
		|ИЗ
		|	РегистрСведений.ДанныеЗадачи.СрезПоследних КАК ДанныеЗадачи
		|ГДЕ
		|	ДанныеЗадачи.Задача = &Задача";
	
	Запрос.УстановитьПараметр("Задача", Объект.Ссылка);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		Исполнитель = Выборка.Исполнитель;
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	
	Если ПустаяСтрока(Объект.Наименование) Тогда
		
		Если ПустаяСтрока(Объект.Сообщение) Тогда
		
			Отказ = Истина;
			НЕЗакрывать = Отказ;
			ПоказатьПредупреждение(, "Не заполнено наименование и сообщение");
		
		Иначе
			Объект.Наименование = Объект.Сообщение;
		КонецЕсли;
		
	КонецЕсли;
	
	НЕЗакрывать = Отказ;

	Если НЕ Отказ Тогда
	
		Объект.Наблюдатели.Очистить();
		
		Для каждого х Из СписокНаблюдателей Цикл
			
			Если ЗначениеЗаполнено(х.Значение) Тогда
				
				НС = Объект.Наблюдатели.Добавить();
				НС.Наблюдатель = х.Значение;
			
			КонецЕсли;
			
		КонецЦикла;  
			
	КонецЕсли;
	
КонецПроцедуры 

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	КартитнкаДобавлена = Ложь;
	
	ЗаполнитьТипАдресации();
	
	Если ЗначениеЗаполнено(Объект.ДолжностьИсполнителя) Тогда
		ПоДолжности = Истина;	
	Иначе
		ПоДолжности = Ложь;	
	КонецЕсли;
	
	ПоДолжностиПриИзменении(Неопределено);
	
	Если Объект.Выполнена Тогда
		
		ТолькоПросмотр = Истина;
		Элементы.ДолжностьИсполнителя.ТолькоПросмотр 	= Истина;
		Элементы.ТипАдресации.ТолькоПросмотр 			= Истина; 
		Элементы.ГруппаНаблюдатели.ТолькоПросмотр		= Истина;	
		Элементы.ФормаВыполнена.Доступность 			= Ложь;	
		Элементы.ФормаЗаписать.Доступность 				= Ложь;	
		Элементы.ФормаДобавитьКартинку.Видимость 		= Ложь;	
		Элементы.ГруппаКнопкиНаблюдатели.Видимость		= Ложь;	
		Элементы.ФормаОтменить.Видимость 				= Ложь;	
		Элементы.Переадресация.Видимость				= Ложь;
		
		ВидимостьКнопкиНаблюдатели 						= Ложь;
		
	ИначеЕсли Параметры.Ключ.Пустая() Тогда
	
		Элементы.Исполнение.ТолькоПросмотр 	= Истина;	
		Элементы.ФормаВыполнена.Доступность = Ложь;	
		Элементы.ФормаОтменить.Видимость 	= Ложь;	
		Элементы.Переадресация.Видимость	= Ложь;
		Объект.ОжидаемаяДатаВыполнения		= Объект.Дата + 24 * 3600;

	
	Иначе
	
		Элементы.Сообщение.ТолькоПросмотр 				= Истина;	
		Элементы.ГруппаНаблюдатели.ТолькоПросмотр		= Истина;	
		Элементы.Наименование.ТолькоПросмотр 			= Истина;	
		Элементы.Направление.ТолькоПросмотр 			= Истина;	
		Элементы.ТипЗадачи.ТолькоПросмотр 				= Истина;	
		Элементы.ОжидаемаяДатаВыполнения.ТолькоПросмотр	= Истина;	
		Элементы.Исполнитель.ТолькоПросмотр 			= Истина;	
		Элементы.Сообщение.ТолькоПросмотр 				= Истина;	
		Элементы.ТипАдресации.ТолькоПросмотр			= Истина;	
		Элементы.ОбъектАдресации.ТолькоПросмотр			= Истина;	
		Элементы.ПоДолжности.ТолькоПросмотр				= Истина;	
		Элементы.ДолжностьИсполнителя.ТолькоПросмотр	= Истина;	
		Элементы.НуженОтчетОВыполнении.Доступность 		= Ложь;	
		Элементы.ГруппаКнопкиНаблюдатели.Видимость		= Ложь;	
		
		Элементы.ФормаЗаписать.Доступность 				= Ложь;
		Элементы.ФормаДобавитьКартинку.Видимость 		= Ложь;	
		Элементы.ОжидаемаяДатаВыполнения.Видимость		= Ложь;
		
		ВидимостьКнопкиНаблюдатели = Ложь;
		
	КонецЕсли; 
	
	Если Объект.ТипЗадачи = ПредопределенноеЗначение("Перечисление.ТипыОбщихЗадач.Информация") Тогда
		Элементы.Исполнение.Видимость = Ложь;	
	КонецЕсли;
	
	Если Объект.Направление = ПредопределенноеЗначение("Справочник.НаправленияОбщихЗадач.БагТрекер") Тогда
	    ВидимостьЭлементовБегТрека();
	КонецЕсли;
	
	
	Элементы.НуженОтчетОВыполнении.Видимость = НЕ Объект.ОтчетОВыполнении;
	
	ОбъектАдресацииПриИзменении(Неопределено);
	ЗаголовокНаблюдатели();
	
КонецПроцедуры

&НаКлиенте
Процедура ВидимостьЭлементовБегТрека()

	Элементы.ГруппаНаблюдатели.Видимость 			= Ложь;
	Элементы.ТипЗадачи.ТолькоПросмотр 				= Истина;
	Элементы.Направление.ТолькоПросмотр				= Истина;
	Элементы.НуженОтчетОВыполнении.ТолькоПросмотр	= Истина;
	
	Если НЕ ЗначениеЗаполнено(Исполнитель) Тогда
		Исполнитель 				= омБазаЗнанийПовтор.АвторИсполненияБэгТрека();
	КонецЕсли;
	
	Объект.ТипЗадачи 				= ПредопределенноеЗначение("Перечисление.ТипыОбщихЗадач.Информация");
	Объект.НуженОтчетОВыполнении 	= Ложь;
		
КонецПроцедуры // ВидимостьВЗависимостиОтТипа()


&НаСервереБезКонтекста
Функция ПолучитьДополнительнуюИнформацию(ОбъектАдресации)
	
	СтруктураВозврата = Новый Структура("ДопИнформация, Проект, ОбъектТЗ", "");
	
	ТипОбъектАдресации = ТипЗнч(ОбъектАдресации);
	
	Если ТипОбъектАдресации = Тип("СправочникСсылка.ИзделияЗаказчика") Тогда
		
		ТипАдресации = "Изделие заказчика";	
		
		Запрос = Новый Запрос;
		Запрос.Текст = 
			"ВЫБРАТЬ
			|	ДанныеИзделияЗаказчика.Артикул КАК Артикул,
			|	ДанныеИзделияЗаказчика.Проект КАК Проект
			|ИЗ
			|	РегистрСведений.ДанныеИзделияЗаказчика КАК ДанныеИзделияЗаказчика
			|ГДЕ
			|	ДанныеИзделияЗаказчика.ИзделиеЗаказчика = &ИзделиеЗаказчика";
			
		Запрос.УстановитьПараметр("ИзделиеЗаказчика", ОбъектАдресации);
		
		Выборка = Запрос.Выполнить().Выбрать();
		
		Пока Выборка.Следующий() Цикл
			
			СтруктураВозврата.Проект = Выборка.Проект;
			СтруктураВозврата.ДопИнформация = Выборка.Артикул;
			
			Возврат СтруктураВозврата;
			
		КонецЦикла;

	ИначеЕсли ТипОбъектАдресации = Тип("СправочникСсылка.Проекты") Тогда
	
		Запрос = Новый Запрос;
		Запрос.Текст = 
			"ВЫБРАТЬ
			|	Проекты.Префикс КАК Префикс,
			|	Проекты.Номер КАК Номер
			|ИЗ
			|	Справочник.Проекты КАК Проекты
			|ГДЕ
			|	Проекты.Ссылка = &Ссылка";
		
		Запрос.УстановитьПараметр("Ссылка", ОбъектАдресации);
		
		Выборка = Запрос.Выполнить().Выбрать();
		
		Пока Выборка.Следующий() Цикл

			СтруктураВозврата.Проект 		= ОбъектАдресации;
			СтруктураВозврата.ДопИнформация = Выборка.Префикс + " (" + Выборка.Номер + ")";
			
			Возврат СтруктураВозврата;
			
		КонецЦикла;
		
	ИначеЕсли ТипОбъектАдресации = Тип("ЗадачаСсылка.Задачи_ПКД") ИЛИ ТипОбъектАдресации = Тип("ЗадачаСсылка.Задачи_РКД") Тогда
		СтруктураВозврата.ОбъектТЗ = ОбъектАдресации.ОбъектТЗ;	
	ИначеЕсли ТипОбъектАдресации = Тип("ДокументСсылка.Рекламации") Тогда
		
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	Рекламации.Проект КАК Проект,
		|	Рекламации.Комплект.Наименование КАК КомплектНаименование,
		|	Рекламации.Комплект КАК ОбъектТЗ
		|ИЗ
		|	Документ.Рекламации КАК Рекламации";
		
		РезультатЗапроса = Запрос.Выполнить();
		
		Выборка = РезультатЗапроса.Выбрать();
		
		Пока Выборка.Следующий() Цикл
			
			СтруктураВозврата.ОбъектТЗ 		= Выборка.ОбъектТЗ;
			СтруктураВозврата.Проект 		= Выборка.Проект;
			СтруктураВозврата.ДопИнформация = Выборка.КомплектНаименование;
			
			Возврат СтруктураВозврата;
			
		КонецЦикла;
		
	КонецЕсли;
	
	СтруктураВозврата.Проект = ОбъектАдресации.Проект;
	
	Возврат СтруктураВозврата;
	
КонецФункции // ПолучитьДополнительнуюИнформацию()

&НаКлиенте
Процедура ЗаполнитьТипАдресации()
	
	ТипАдресации = омЗадачаОбщаяНаКлиенте.ТипАдресацииПоОбъекту(Объект.ОбъектАдресации);
	
	ТипАдресацииПриИзменении(Неопределено);

КонецПроцедуры // ЗаполнитьТипАдресацииэ()

&НаКлиенте
Процедура ТипАдресацииПриИзменении(Элемент)
	
	Элементы.ГруппаКнопкиНаблюдатели.Видимость = Ложь;
		
	Если НЕ Элемент = Неопределено Тогда
		
		Объект.ОбъектАдресации 	= Неопределено; 
		ДополнительноеПоле 		=  "";
		
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(ТипАдресации) Тогда
		
		ТипАдресации = "Нет";
		Элементы.ОбъектАдресации.ТолькоПросмотр = Истина;
		ВидимостьКнопкиНаблюдатели 				= Ложь;
		
	ИначеЕсли ТипАдресации = "Нет" Тогда
	
		Элементы.ОбъектАдресации.ТолькоПросмотр = Истина;
		Объект.ОбъектАдресации = Неопределено;
		ВидимостьКнопкиНаблюдатели 				= Ложь;
	
	Иначе
	
		Элементы.ОбъектАдресации.ТолькоПросмотр = Ложь;
		
		Если ТипАдресации = "Изделие заказчика" Тогда
		
			Элементы.ОбъектАдресации.ОграничениеТипа = Новый ОписаниеТипов("СправочникСсылка.ИзделияЗаказчика");	
			ВидимостьКнопкиНаблюдатели = Истина;
			
		ИначеЕсли ТипАдресации = "Контрагент" Тогда
		
			Элементы.ОбъектАдресации.ОграничениеТипа = Новый ОписаниеТипов("СправочникСсылка.Контрагенты");	
			ВидимостьКнопкиНаблюдатели 				 = Ложь;
		
		ИначеЕсли ТипАдресации = "Комплект" Тогда
		
			Элементы.ОбъектАдресации.ОграничениеТипа = Новый ОписаниеТипов("СправочникСсылка.ИзделияКомплект");	
			ВидимостьКнопкиНаблюдатели 				 = Истина;
		
		ИначеЕсли ТипАдресации = "Композиция" Тогда
		
			Элементы.ОбъектАдресации.ОграничениеТипа = Новый ОписаниеТипов("СправочникСсылка.Композиции");	
			ВидимостьКнопкиНаблюдатели 				 = Истина;
		
		ИначеЕсли ТипАдресации = "Помещение" Тогда
		
			Элементы.ОбъектАдресации.ОграничениеТипа = Новый ОписаниеТипов("СправочникСсылка.Помещения");	
			ВидимостьКнопкиНаблюдатели 				 = Истина;
		
		ИначеЕсли ТипАдресации = "Проект" Тогда
		
			Элементы.ОбъектАдресации.ОграничениеТипа = Новый ОписаниеТипов("СправочникСсылка.Проекты");	
			ВидимостьКнопкиНаблюдатели 				 = Истина;
		
		ИначеЕсли ТипАдресации = "Рекламация" Тогда
		
			Элементы.ОбъектАдресации.ОграничениеТипа = Новый ОписаниеТипов("ДокументСсылка.Рекламации");	
			ВидимостьКнопкиНаблюдатели 				 = Истина;
		
		ИначеЕсли ТипАдресации = "Задачи ПКД" Тогда
		
			Элементы.ОбъектАдресации.ОграничениеТипа = Новый ОписаниеТипов("ЗадачаСсылка.Задачи_ПКД");	
			ВидимостьКнопкиНаблюдатели 				 = Истина;
		
		ИначеЕсли ТипАдресации = "Задачи РКД" Тогда
			
			Элементы.ОбъектАдресации.ОграничениеТипа = Новый ОписаниеТипов("ЗадачаСсылка.Задачи_РКД");	
			ВидимостьКнопкиНаблюдатели 				 = Истина;
			
		Иначе
			
			Элементы.ОбъектАдресации.ТолькоПросмотр = Истина;
			Объект.ОбъектАдресации 					= Неопределено;
			ВидимостьКнопкиНаблюдатели 				= Ложь;
			
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОбъектАдресацииПриИзменении(Элемент)
	
	Если ЗначениеЗаполнено(Объект.ОбъектАдресации) Тогда
		
		Элементы.ТипАдресации.Доступность 	= Ложь;
		Элементы.ПоДолжности.Доступность 	= Истина;
		ДанныеОбъекта = ПолучитьДополнительнуюИнформацию(Объект.ОбъектАдресации);
		ДополнительноеПоле = ДанныеОбъекта.ДопИнформация;
		
		Если ЗначениеЗаполнено(Объект.ДолжностьИсполнителя)  Тогда
			ТекущийИсполнитель = ЗаполнитьИсполнителя(Объект.ОбъектАдресации, Объект.ДолжностьИсполнителя);	
		Иначе
			ТекущийИсполнитель = Неопределено;
		КонецЕсли;
		
		Элементы.ГруппаКнопкиНаблюдатели.Видимость = ВидимостьКнопкиНаблюдатели;
		
		Если ВидимостьКнопкиНаблюдатели Тогда
			
			Если ТипАдресации = "Комплект" ИЛИ ТипАдресации = "Композиция" Тогда
				
				стСотрудники = омСотрудники.СотрудникиОбъекта(Объект.ОбъектАдресации);
			
			ИначеЕсли ТипАдресации = "Задачи ПКД" ИЛИ ТипАдресации = "Задачи РКД" Тогда
				
				стСотрудники = омСотрудники.СотрудникиОбъекта(ДанныеОбъекта.ОбъектТЗ);
				
			Иначе
				
				стСотрудники = омПроекты.ПолучитьПользователейПроекта(ДанныеОбъекта.Проект);
				
			КонецЕсли;
			
			Элементы.ДобавитьКонструктора.Видимость = ЗначениеЗаполнено(стСотрудники.Конструктор);
			Элементы.ДобавитьМенеджера.Видимость 	= ЗначениеЗаполнено(стСотрудники.Менеджер);
			Элементы.ДобавитьВедущего.Видимость 	= ЗначениеЗаполнено(стСотрудники.ВедущийКонструктор);
			Элементы.ДобавитьДизайнер.Видимость 	= ЗначениеЗаполнено(стСотрудники.Дизайнер);
			Элементы.ДобавитьЗамерщика.Видимость 	= ЗначениеЗаполнено(стСотрудники.Замерщик);
		
		КонецЕсли;      
		
	Иначе
		
		Элементы.ПоДолжности.Доступность 	= Ложь;
		ДополнительноеПоле 					= "";
		ПоДолжност							= Ложь;         
		ПоДолжностиПриИзменении(Неопределено); 
		ТекущийИсполнитель 					= Неопределено;
		Элементы.ГруппаКнопкиНаблюдатели.Видимость = Ложь;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаписатьЗадачу(Команда)
	
	Если НЕ ЗначениеЗаполнено(Исполнитель) И ПустаяСтрока(Объект.ДолжностьИсполнителя) Тогда
	
		ПоказатьПредупреждение(, "Не заполнен исполнитель");
		Возврат;	
	
	КонецЕсли;
	
	Записать();
	
	Если Не НЕЗакрывать Тогда
	
		Закрыть();
	
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура Выполнена(Команда)
	
	Если Объект.ТипЗадачи = ПредопределенноеЗначение("Перечисление.ТипыОбщихЗадач.Вопрос")
		ИЛИ Объект.ТипЗадачи = ПредопределенноеЗначение("Перечисление.ТипыОбщихЗадач.Действие") Тогда
	
		Если ПустаяСтрока(Объект.Исполнение) Тогда
		
			ПоказатьПредупреждение(, "Не заполнено исполнение");
			Возврат;
		
		КонецЕсли; 
		
		Если Объект.ТипЗадачи = ПредопределенноеЗначение("Перечисление.ТипыОбщихЗадач.Вопрос") Тогда
			НачалоОповещения = "Ответ: ";
		Иначе
			НачалоОповещения = "Выполнено: ";
		КонецЕсли;
		                   
		НачалоОповещения = НачалоОповещения + Лев(СокрЛ(Объект.Исполнение), 43);
		
	Иначе
		
		НачалоОповещения  = "Прочитано: " + СокрЛ(Объект.Наименование);

	КонецЕсли;
	
	Объект.ДатаВыполнения 	= ТекущаяДата();
	Объект.Выполнена 		= Истина;
	Объект.АвторИсполнения 	= омСотрудники.ПолучитьТекущегоПользователя();
	Записать();
	
	Если Объект.НуженОтчетОВыполнении Тогда
	
		СсылкаЗадачиОповещения = СоздатьОтчетОВыполнении(Объект.Ссылка, Объект.Наименование, НачалоОповещения, Объект.Проект);	
		омЗадачаОбщаяНаСервере.ЗаписатьИсполнителяНаСервере(СсылкаЗадачиОповещения, Объект.Автор);
	
	КонецЕсли;
	
	Закрыть();
	
КонецПроцедуры 

&НаСервереБезКонтекста
Функция СоздатьОтчетОВыполнении(Ссылка, Наименование, ТекстОповещения, Проект)

	ЗадачаОповещение 					= Задачи.ЗадачиОбщие.СоздатьЗадачу();
	ЗадачаОповещение.Автор 				= ПараметрыСеанса.ТекущийПользователь;
	ЗадачаОповещение.Дата			 	= ТекущаяДата();
	ЗадачаОповещение.Наименование 		= ТекстОповещения;
	ЗадачаОповещение.ОтчетОВыполнении 	= Истина;
	ЗадачаОповещение.Проект 			= Проект; 
	ЗадачаОповещение.СвязаннаяЗадача 	= Ссылка;
	ЗадачаОповещение.ТипЗадачи 			= Перечисления.ТипыОбщихЗадач.Информация;
	ЗадачаОповещение.Направление		= Справочники.НаправленияОбщихЗадач.ОтчетВыполнения;
	
	ЗадачаОповещение.Записать();
	
	Возврат ЗадачаОповещение.Ссылка;

КонецФункции // СоздатьОтчетОВыполнении(Ссылка, Наименование,  ТекстОповещения, Проект)

&НаКлиенте
Процедура ДолжностьПриИзменении(Элемент)
	Если ЗначениеЗаполнено(Объект.ДолжностьИсполнителя) И НЕ Объект.ДолжностьИсполнителя = "Нет" И ЗначениеЗаполнено(Объект.ОбъектАдресации) Тогда
		ТекущийИсполнитель 	= ЗаполнитьИсполнителя(Объект.ОбъектАдресации, Объект.ДолжностьИсполнителя);	
	Иначе
		ТекущийИсполнитель 	= Неопределено;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПоДолжностиПриИзменении(Элемент)
	
	Если ПоДолжности Тогда
		Элементы.ДолжностьИсполнителя.Видимость = Истина;
		Элементы.Исполнитель.Видимость 			= Ложь;
		Исполнитель 							= Неопределено;
		
		Если Элементы.ДолжностьИсполнителя.СписокВыбора.Количество() = 0 Тогда
			омЗадачаОбщаяНаКлиенте.ЗаполнитьСписокДолжности(Элементы.ДолжностьИсполнителя.СписокВыбора);
		КонецЕсли;
		
	Иначе
		Элементы.Исполнитель.Видимость 			= Истина;
		Элементы.ДолжностьИсполнителя.Видимость = Ложь;
		Объект.ДолжностьИсполнителя 			= "";
	КонецЕсли;
	
	Элементы.ТекущийИсполнитель.Видимость		= Элементы.ДолжностьИсполнителя.Видимость;
	
КонецПроцедуры 

&НаКлиенте
Процедура ДолжностьИсполнителяНачалоВыбораИзСписка(Элемент, СтандартнаяОбработка)
	
	Если Элементы.ДолжностьИсполнителя.СписокВыбора.Количество() = 0 Тогда
		омЗадачаОбщаяНаКлиенте.ЗаполнитьСписокДолжности(Элементы.ДолжностьИсполнителя);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ТипЗадачиПриИзменении(Элемент)
	
	Элементы.Исполнение.Видимость = НЕ Объект.ТипЗадачи = ПредопределенноеЗначение("Перечисление.ТипыОбщихЗадач.Информация");	
	
КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	Если ЗначениеЗаполнено(ТекущийОбъект.ОбъектАдресации) Тогда
		
		Если ТипЗнч(ТекущийОбъект.ОбъектАдресации) = Тип("СправочникСсылка.Проекты") Тогда
			ТекущийОбъект.Проект = ТекущийОбъект.ОбъектАдресации;
		ИначеЕсли ТипЗнч(ТекущийОбъект.ОбъектАдресации) = Тип("СправочникСсылка.Контрагенты") Тогда
			ТекущийОбъект.Проект = Справочники.Проекты.ПустаяСсылка();
		Иначе
			ТекущийОбъект.Проект = ТекущийОбъект.ОбъектАдресации.Проект;
		КонецЕсли;	
		
	Иначе
		
		ТекущийОбъект.Проект = Справочники.Проекты.ПустаяСсылка();
		
	КонецЕсли;	
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
	
	ТекущийИсполнитель = ПредопределенноеЗначение("Справочник.Пользователи.ПустаяСсылка");
	
	Если ЗначениеЗаполнено(Исполнитель) Тогда
		ТекущийИсполнитель = Исполнитель;	
	ИначеЕсли ЗначениеЗаполнено(Объект.ОбъектАдресации) И НЕ ПустаяСтрока(Объект.ДолжностьИсполнителя) Тогда
		ТекущийИсполнитель = омСотрудники.ПолучитьИсполнителяОбъекта(Объект.ОбъектАдресации, Объект.ДолжностьИсполнителя, Истина);	
	КонецЕсли;
	
	омЗадачаОбщаяНаСервере.ЗаписатьИсполнителяНаСервере(Объект.Ссылка, ТекущийИсполнитель);
	
	Если КартитнкаДобавлена Тогда
		ЗаписатьФайлКартинкиНаСервере(АдресКартинки, Объект.Ссылка);
	КонецЕсли;
		
	Оповестить("ИзмененаОбщаяЗадача");

КонецПроцедуры

&НаКлиенте
Процедура Отменить(Команда)
	Объект.Отменена 	= Истина;
	Объект.Выполнена 	= Истина;
	Записать();
	Закрыть();	
КонецПроцедуры

&НаКлиенте
Процедура ЗаголовокНаблюдатели()

	КоличествоНаблюдателей = СписокНаблюдателей.Количество();
	Элементы.ГруппаНаблюдатели.Заголовок = "Наблюдатели" + ?(КоличествоНаблюдателей = 0, "", "(" + КоличествоНаблюдателей + ")");	

КонецПроцедуры // ЗаголовокНаблюдатели()

&НаКлиенте
Процедура ДобавитьЗамерщика(Команда)
	
	ДобавляемыйСотрудник = стСотрудники.Замерщик;
	ДобавитьСотрудникаВНаблюдатели(ДобавляемыйСотрудник);
	
КонецПроцедуры

&НаКлиенте
Процедура ДобавитьВедущего(Команда)
	
	ДобавляемыйСотрудник = стСотрудники.ВедущийКонструктор;
	ДобавитьСотрудникаВНаблюдатели(ДобавляемыйСотрудник);
	
КонецПроцедуры

&НаКлиенте
Процедура ДобавитьДизайнера(Команда)
	
	ДобавляемыйСотрудник = стСотрудники.Дизайнер;
	ДобавитьСотрудникаВНаблюдатели(ДобавляемыйСотрудник);
	
КонецПроцедуры

&НаКлиенте
Процедура ДобавитьМенеджера(Команда)
	
	ДобавляемыйСотрудник = стСотрудники.Менеджер;
	ДобавитьСотрудникаВНаблюдатели(ДобавляемыйСотрудник);
	
КонецПроцедуры

&НаКлиенте
Процедура ДобавитьКонструктора(Команда)
	
	ДобавляемыйСотрудник = стСотрудники.Конструктор;
	ДобавитьСотрудникаВНаблюдатели(ДобавляемыйСотрудник);
	
КонецПроцедуры 

&НаКлиенте
Процедура ДобавитьСотрудникаВНаблюдатели(ДобавляемыйСотрудник)

	Если СписокНаблюдателей.НайтиПоЗначению(ДобавляемыйСотрудник) = Неопределено Тогда
	
		СписокНаблюдателей.Добавить(ДобавляемыйСотрудник);		
		ЗаголовокНаблюдатели();
		
		Модифицированность = Истина;
	
	КонецЕсли;
	
КонецПроцедуры // ДобавитьСотрудникаВНаблюдатели()

&НаКлиенте
Процедура СписокНаблюдателейПриИзменении(Элемент)
	ЗаголовокНаблюдатели();
КонецПроцедуры

&НаКлиенте
Процедура Переадресация(Команда)

	Если Модифицированность Тогда
		ПоказатьПредупреждение(, "Для переадресации необходимо сохранить задачу.");
	Иначе 	
		
		ОписаниеОповещения = Новый ОписаниеОповещения("ПослеИзмененияИсполнителя", ЭтаФорма);  
		ПараметрПереадресации = Новый Структура("ОбъектАдресации, Задача", Объект.ОбъектАдресации, Объект.Ссылка);
		ОткрытьФорму("Задача.ЗадачиОбщие.Форма.ФормаПереадресации", ПараметрПереадресации, ЭтаФорма, , , , ОписаниеОповещения, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
		
	КонецЕсли;
	
	
КонецПроцедуры   

&НаКлиенте
Процедура ПослеИзмененияИсполнителя(Результат, ДополнительныеПараметры) Экспорт

	Если НЕ Результат = Неопределено Тогда
	
		Закрыть();
	
	КонецЕсли;	

КонецПроцедуры // ПослеИзмененияИсполнителя() 

#Область Картинки

&НаКлиенте
Процедура ДобавитьКартинку(Команда)
	
	СтрутураПараметров = Новый Структура("УИДПервойФормы", УникальныйИдентификатор); 
	
	Оповещение = Новый ОписаниеОповещения("ПослеВыбораКартинки", ЭтаФорма);
	ОткрытьФорму("ОбщаяФорма.ФормаДобавитьКартинку", СтрутураПараметров, ЭтаФорма, , , , Оповещение, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
КонецПроцедуры 

&НаКлиенте
Процедура ПослеВыбораКартинки(Результат, ДополнительныеПараметры) Экспорт

	Если ЗначениеЗаполнено(Результат) Тогда
		
		АдресКартинки 						= Результат;
		КартитнкаДобавлена 					= Истина;
		Элементы.АдресКартинки.Видимость 	= Истина;

	КонецЕсли;	

КонецПроцедуры // ДобавитьКартинку()
 
Функция ЗаписатьФайлКартинкиНаСервере(АдресКартинки, ЭлементСделки) 
	
	МЗ = РегистрыСведений.КартинкиНоменклатуры.СоздатьМенеджерЗаписи();
	
	МЗ.ИзделиеЭлемент 	= ЭлементСделки;
	МЗ.ИмяФайла 		= "КартинкаЗадачи.jpg";
	МЗ.Картинка 		= Новый ХранилищеЗначения(ПолучитьИзВременногоХранилища(АдресКартинки));
	
	МЗ.Записать();
	
КонецФункции

&НаСервере
Процедура ОбновитьКартинки()	
	КлючКартинки = РегистрыСведений.КартинкиНоменклатуры.СоздатьКлючЗаписи(Новый Структура("ИзделиеЭлемент", Объект.Ссылка));
	АдресКартинки = ПолучитьНавигационнуюСсылку(КлючКартинки, "Картинка");
КонецПроцедуры


#КонецОбласти

&НаКлиенте
Процедура Переадресация1ПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)
	Отказ = Истина;
КонецПроцедуры

&НаКлиенте
Процедура Переадресация1ПередУдалением(Элемент, Отказ)
	Отказ = Истина;
КонецПроцедуры

&НаКлиенте
Процедура Переадресация1ПередНачаломИзменения(Элемент, Отказ)
	Отказ = Истина;
КонецПроцедуры

&НаКлиенте
Процедура ИсполнительПриИзменении(Элемент)
	ПоДолжностиПриИзменении(Неопределено);
	ОбъектАдресацииПриИзменении(Неопределено);
КонецПроцедуры
